'number' + 3 + 3
/* Відповідь: "number33"
    1. Перша трійка конвертується до стрінга  відбувається конкатенація отримуєм 'number3'
    2. Друга трійка конвертується до стрінга відбувається конкатенація отримуєм 'number33'
*/

null + 3
/* Відповідь: 3
    1. null конвертується до 0
    2.  Відбувається арифметична дія 0 + 3 отримуєм результат
*/

5 && "qwerty"
/* Відповідь: "qwerty"
    1. Відбувається перевірка чи перший операнд є true 
    2. Відбувається перевірка чи другий операнд є true 
    3. Повертається останнє значення що є true тобто "qwerty"
*/

+'40' + +'2' + "hillel";
/* Відповідь: "42hillel"
    1. Стрінга "40" явно перетворюється в намбер 40
    2. Стрінга "2" явно перетворюється в 2
    3. Відбувається додавання чисел 4 та 2
    4. Відбувається конкатенаця числа 42 і стрінги "hillel"
*/

'10' - 5 === 6;
/* Відповідь: false
    1. Стрінга "10" конвертується в намбер 10
    2. Відбувається операція віднімання 10 - 5 що дає результат 5
    3. Відбувається строге порівняння чисел 5 та 6, 5 не дорівнює 6 повертається результат false
*/

true + false
/* Відповідь: 1
    1. Відбувається конвертація true до 1
    2. Відбувається конвертація false до 0
    3. Відбувається арифметична операція 1 + 0 
*/

'4px' - 3
/* Відповідь: NaN
    1. Відбувається спроба перетворити стрінгу '4px' отримуєм NaN
    2. Відбувається спроба відняти від NaN намбер 3
    3. Будь-які арифметичні дії з NaN дають результат NaN
*/

'4' - 3
/* Відповідь: 1
    1. Відбувається спроба виконати віднімання якшо один операнд є стрінгой
    2. Відбувається конвертація стрінги '4' до намбера 4
    3. Відбувається арифметична дія 4 - 3
*/

'6' + 3 ** 0;
/* Відповідь: 61
    1. Відбувається піднесення намбера 3 до ступеня намбера 0 отримуєм 1
    2. Відбувається конкатенація стрінги '6' та намберу 1
*/

12 / '6'
/* Відповідь; 2
    1. Відбувається спроба виконати операцію ділення якшо один операнд є стрінгой
    2. Стрінга '6' перетворюється в намбер 6
    3. Відбувається арифметична дія ділення 12 на 6
*/

'10' + (5 === 6);
/* Відповідь: "10false"
    1. Відбувається суворе порівняння намберів 5 і 6 отримуєм результат false
    2. Відбувається спроба конкатенації стрінги '10' і відповідно перетворення false в стрінгу
*/

null == ''
/* Відповідь: false
    1. Відбувається не строге порівняння між null та пустим рядком. null може бути рівним тільки самому собі
    тому маємо резудьтат false
*/
    
3 ** (9 / 3);
/* Відповідь: 27
    1. Відбувається дія ділення в лапках отримуєм результат 3
    2. Відбувається піднесення намберу 3 до результату дії в лапках (намберу 3)
*/

!!'false' == !!'true'
/* Відповідь true
    1. Відбувається перетвроення рядка 'false' на булеве значення отримуєм true так як рядок не пустий
    2. Відбувається перетвроення рядка 'true' на булеве значення отримуєм true так як рядок не пустий
    3. Відбувається не строге порівняння між першими двома результатами true дорівнює true тому маєм цей результат
*/

0 || '0' && 1
/*  Відповідь 1
    1. Відбувається обчислення виразу '0' && 1, що повертає остеннє значення намбер 1
    2. Відбувається виконання  операції 0 || 1, що повертає значення яке є true (0 false) тому результат 1
*/

(+null == false) < 1;
/*  Відповідь false
    1. Відбувається явне перетворення null до числа що є 0
    2. Відбуважться не строге порівняння міш 0 та false (тобто зараз false перетворюється на 0) отримуєм результат 0 == 0 що
    є true
    3. Відбувається арифметичне порівняння між true та 1 (зараз true перетворюється на 1) в результаті маєм 1 < 1 що є false
*/

false && true || true
/* Відповідь true
    1. Оператор && повертає перше "false" значення тобто false
    2. Оператор || повертає перше значення "true" тобто true 
*/

false && (false || true);
/* Відповідь false 
    1. Спочатку виконується дія в дужках оператор || повертає перше значення "true" тобто результат цієї дії true
    2. Оператор && повертає перше "false" значення.
    Оскільки перший операнд — це false а другий true (false && true) результатом операції є false (перший операнд)
*/

(+null == false) < 1 ** 5;
/* Відповідь false
1. Відбувається дія в дужках null явно перетворюється в 0 і відбувається не строге порівняння між 0 та false
(зараз false стає 0) результатом ціє дії є true
2. Відбувається обчислення виразу 1 ** 5 шо дає результат 1
3. Відбувається спроба порівнняня між true та 1. true перетворюється на 1 та відбувається порівняння між 1 < 1 що дає результат false 
*/